HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMsc_bf.h
/** \\brief  Length for Ifx_MSC_ACCEN0_Bits.EN27 */
#define IFX_MSC_ACCEN0_EN27_LEN (1)

/** \\brief  Mask for Ifx_MSC_ACCEN0_Bits.EN27 */
#define IFX_MSC_ACCEN0_EN27_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ACCEN0_Bits.EN27 */
#define IFX_MSC_ACCEN0_EN27_OFF (27)

/** \\brief  Length for Ifx_MSC_ACCEN0_Bits.EN28 */
#define IFX_MSC_ACCEN0_EN28_LEN (1)

/** \\brief  Mask for Ifx_MSC_ACCEN0_Bits.EN28 */
#define IFX_MSC_ACCEN0_EN28_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ACCEN0_Bits.EN28 */
#define IFX_MSC_ACCEN0_EN28_OFF (28)

/** \\brief  Length for Ifx_MSC_ACCEN0_Bits.EN29 */
#define IFX_MSC_ACCEN0_EN29_LEN (1)

/** \\brief  Mask for Ifx_MSC_ACCEN0_Bits.EN29 */
#define IFX_MSC_ACCEN0_EN29_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ACCEN0_Bits.EN29 */
#define IFX_MSC_ACCEN0_EN29_OFF (29)

/** \\brief  Length for Ifx_MSC_ACCEN0_Bits.EN2 */
#define IFX_MSC_ACCEN0_EN2_LEN (1)

/** \\brief  Mask for Ifx_MSC_ACCEN0_Bits.EN2 */
#define IFX_MSC_ACCEN0_EN2_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ACCEN0_Bits.EN2 */
#define IFX_MSC_ACCEN0_EN2_OFF (2)

/** \\brief  Length for Ifx_MSC_ACCEN0_Bits.EN30 */
#define IFX_MSC_ACCEN0_EN30_LEN (1)

/** \\brief  Mask for Ifx_MSC_ACCEN0_Bits.EN30 */
#define IFX_MSC_ACCEN0_EN30_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ACCEN0_Bits.EN30 */
#define IFX_MSC_ACCEN0_EN30_OFF (30)

/** \\brief  Length for Ifx_MSC_ACCEN0_Bits.EN31 */
#define IFX_MSC_ACCEN0_EN31_LEN (1)

/** \\brief  Mask for Ifx_MSC_ACCEN0_Bits.EN31 */
#define IFX_MSC_ACCEN0_EN31_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ACCEN0_Bits.EN31 */
#define IFX_MSC_ACCEN0_EN31_OFF (31)

/** \\brief  Length for Ifx_MSC_ACCEN0_Bits.EN3 */
#define IFX_MSC_ACCEN0_EN3_LEN (1)

/** \\brief  Mask for Ifx_MSC_ACCEN0_Bits.EN3 */
#define IFX_MSC_ACCEN0_EN3_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ACCEN0_Bits.EN3 */
#define IFX_MSC_ACCEN0_EN3_OFF (3)

/** \\brief  Length for Ifx_MSC_ACCEN0_Bits.EN4 */
#define IFX_MSC_ACCEN0_EN4_LEN (1)

/** \\brief  Mask for Ifx_MSC_ACCEN0_Bits.EN4 */
#define IFX_MSC_ACCEN0_EN4_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ACCEN0_Bits.EN4 */
#define IFX_MSC_ACCEN0_EN4_OFF (4)

/** \\brief  Length for Ifx_MSC_ACCEN0_Bits.EN5 */
#define IFX_MSC_ACCEN0_EN5_LEN (1)

/** \\brief  Mask for Ifx_MSC_ACCEN0_Bits.EN5 */
#define IFX_MSC_ACCEN0_EN5_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ACCEN0_Bits.EN5 */
#define IFX_MSC_ACCEN0_EN5_OFF (5)

/** \\brief  Length for Ifx_MSC_ACCEN0_Bits.EN6 */
#define IFX_MSC_ACCEN0_EN6_LEN (1)

/** \\brief  Mask for Ifx_MSC_ACCEN0_Bits.EN6 */
#define IFX_MSC_ACCEN0_EN6_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ACCEN0_Bits.EN6 */
#define IFX_MSC_ACCEN0_EN6_OFF (6)

/** \\brief  Length for Ifx_MSC_ACCEN0_Bits.EN7 */
#define IFX_MSC_ACCEN0_EN7_LEN (1)

/** \\brief  Mask for Ifx_MSC_ACCEN0_Bits.EN7 */
#define IFX_MSC_ACCEN0_EN7_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ACCEN0_Bits.EN7 */
#define IFX_MSC_ACCEN0_EN7_OFF (7)

/** \\brief  Length for Ifx_MSC_ACCEN0_Bits.EN8 */
#define IFX_MSC_ACCEN0_EN8_LEN (1)

/** \\brief  Mask for Ifx_MSC_ACCEN0_Bits.EN8 */
#define IFX_MSC_ACCEN0_EN8_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ACCEN0_Bits.EN8 */
#define IFX_MSC_ACCEN0_EN8_OFF (8)

/** \\brief  Length for Ifx_MSC_ACCEN0_Bits.EN9 */
#define IFX_MSC_ACCEN0_EN9_LEN (1)

/** \\brief  Mask for Ifx_MSC_ACCEN0_Bits.EN9 */
#define IFX_MSC_ACCEN0_EN9_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ACCEN0_Bits.EN9 */
#define IFX_MSC_ACCEN0_EN9_OFF (9)

/** \\brief  Length for Ifx_MSC_CLC_Bits.DISR */
#define IFX_MSC_CLC_DISR_LEN (1)

/** \\brief  Mask for Ifx_MSC_CLC_Bits.DISR */
#define IFX_MSC_CLC_DISR_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_CLC_Bits.DISR */
#define IFX_MSC_CLC_DISR_OFF (0)

/** \\brief  Length for Ifx_MSC_CLC_Bits.DISS */
#define IFX_MSC_CLC_DISS_LEN (1)

/** \\brief  Mask for Ifx_MSC_CLC_Bits.DISS */
#define IFX_MSC_CLC_DISS_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_CLC_Bits.DISS */
#define IFX_MSC_CLC_DISS_OFF (1)

/** \\brief  Length for Ifx_MSC_CLC_Bits.EDIS */
#define IFX_MSC_CLC_EDIS_LEN (1)

/** \\brief  Mask for Ifx_MSC_CLC_Bits.EDIS */
#define IFX_MSC_CLC_EDIS_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_CLC_Bits.EDIS */
#define IFX_MSC_CLC_EDIS_OFF (3)

/** \\brief  Length for Ifx_MSC_DC_Bits.DCH */
#define IFX_MSC_DC_DCH_LEN (16)

/** \\brief  Mask for Ifx_MSC_DC_Bits.DCH */
#define IFX_MSC_DC_DCH_MSK (0xffff)

/** \\brief  Offset for Ifx_MSC_DC_Bits.DCH */
#define IFX_MSC_DC_DCH_OFF (16)

/** \\brief  Length for Ifx_MSC_DC_Bits.DCL */
#define IFX_MSC_DC_DCL_LEN (16)

/** \\brief  Mask for Ifx_MSC_DC_Bits.DCL */
#define IFX_MSC_DC_DCL_MSK (0xffff)

/** \\brief  Offset for Ifx_MSC_DC_Bits.DCL */
#define IFX_MSC_DC_DCL_OFF (0)

/** \\brief  Length for Ifx_MSC_DD_Bits.DDH */
#define IFX_MSC_DD_DDH_LEN (16)

/** \\brief  Mask for Ifx_MSC_DD_Bits.DDH */
#define IFX_MSC_DD_DDH_MSK (0xffff)

/** \\brief  Offset for Ifx_MSC_DD_Bits.DDH */
#define IFX_MSC_DD_DDH_OFF (16)

/** \\brief  Length for Ifx_MSC_DD_Bits.DDL */
#define IFX_MSC_DD_DDL_LEN (16)

/** \\brief  Mask for Ifx_MSC_DD_Bits.DDL */
#define IFX_MSC_DD_DDL_MSK (0xffff)

/** \\brief  Offset for Ifx_MSC_DD_Bits.DDL */
#define IFX_MSC_DD_DDL_OFF (0)

/** \\brief  Length for Ifx_MSC_DSC_Bits.CP */
#define IFX_MSC_DSC_CP_LEN (1)

/** \\brief  Mask for Ifx_MSC_DSC_Bits.CP */
#define IFX_MSC_DSC_CP_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_DSC_Bits.CP */
#define IFX_MSC_DSC_CP_OFF (1)

/** \\brief  Length for Ifx_MSC_DSC_Bits.DP */
#define IFX_MSC_DSC_DP_LEN (1)

/** \\brief  Mask for Ifx_MSC_DSC_Bits.DP */
#define IFX_MSC_DSC_DP_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_DSC_Bits.DP */
#define IFX_MSC_DSC_DP_OFF (2)

/** \\brief  Length for Ifx_MSC_DSC_Bits.DSDIS */
#define IFX_MSC_DSC_DSDIS_LEN (1)

/** \\brief  Mask for Ifx_MSC_DSC_Bits.DSDIS */
#define IFX_MSC_DSC_DSDIS_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_DSC_Bits.DSDIS */
#define IFX_MSC_DSC_DSDIS_OFF (15)

/** \\brief  Length for Ifx_MSC_DSC_Bits.ENSELH */
#define IFX_MSC_DSC_ENSELH_LEN (1)

/** \\brief  Mask for Ifx_MSC_DSC_Bits.ENSELH */
#define IFX_MSC_DSC_ENSELH_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_DSC_Bits.ENSELH */
#define IFX_MSC_DSC_ENSELH_OFF (14)

