HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMsc_bf.h
/** \\brief  Length for Ifx_MSC_DSDSH_Bits.SH3 */
#define IFX_MSC_DSDSH_SH3_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSH_Bits.SH3 */
#define IFX_MSC_DSDSH_SH3_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSH_Bits.SH3 */
#define IFX_MSC_DSDSH_SH3_OFF (6)

/** \\brief  Length for Ifx_MSC_DSDSH_Bits.SH4 */
#define IFX_MSC_DSDSH_SH4_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSH_Bits.SH4 */
#define IFX_MSC_DSDSH_SH4_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSH_Bits.SH4 */
#define IFX_MSC_DSDSH_SH4_OFF (8)

/** \\brief  Length for Ifx_MSC_DSDSH_Bits.SH5 */
#define IFX_MSC_DSDSH_SH5_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSH_Bits.SH5 */
#define IFX_MSC_DSDSH_SH5_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSH_Bits.SH5 */
#define IFX_MSC_DSDSH_SH5_OFF (10)

/** \\brief  Length for Ifx_MSC_DSDSH_Bits.SH6 */
#define IFX_MSC_DSDSH_SH6_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSH_Bits.SH6 */
#define IFX_MSC_DSDSH_SH6_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSH_Bits.SH6 */
#define IFX_MSC_DSDSH_SH6_OFF (12)

/** \\brief  Length for Ifx_MSC_DSDSH_Bits.SH7 */
#define IFX_MSC_DSDSH_SH7_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSH_Bits.SH7 */
#define IFX_MSC_DSDSH_SH7_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSH_Bits.SH7 */
#define IFX_MSC_DSDSH_SH7_OFF (14)

/** \\brief  Length for Ifx_MSC_DSDSH_Bits.SH8 */
#define IFX_MSC_DSDSH_SH8_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSH_Bits.SH8 */
#define IFX_MSC_DSDSH_SH8_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSH_Bits.SH8 */
#define IFX_MSC_DSDSH_SH8_OFF (16)

/** \\brief  Length for Ifx_MSC_DSDSH_Bits.SH9 */
#define IFX_MSC_DSDSH_SH9_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSH_Bits.SH9 */
#define IFX_MSC_DSDSH_SH9_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSH_Bits.SH9 */
#define IFX_MSC_DSDSH_SH9_OFF (18)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL0 */
#define IFX_MSC_DSDSL_SL0_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSL_Bits.SL0 */
#define IFX_MSC_DSDSL_SL0_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL0 */
#define IFX_MSC_DSDSL_SL0_OFF (0)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL10 */
#define IFX_MSC_DSDSL_SL10_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSL_Bits.SL10 */
#define IFX_MSC_DSDSL_SL10_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL10 */
#define IFX_MSC_DSDSL_SL10_OFF (20)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL11 */
#define IFX_MSC_DSDSL_SL11_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSL_Bits.SL11 */
#define IFX_MSC_DSDSL_SL11_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL11 */
#define IFX_MSC_DSDSL_SL11_OFF (22)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL12 */
#define IFX_MSC_DSDSL_SL12_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSL_Bits.SL12 */
#define IFX_MSC_DSDSL_SL12_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL12 */
#define IFX_MSC_DSDSL_SL12_OFF (24)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL13 */
#define IFX_MSC_DSDSL_SL13_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSL_Bits.SL13 */
#define IFX_MSC_DSDSL_SL13_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL13 */
#define IFX_MSC_DSDSL_SL13_OFF (26)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL14 */
#define IFX_MSC_DSDSL_SL14_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSL_Bits.SL14 */
#define IFX_MSC_DSDSL_SL14_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL14 */
#define IFX_MSC_DSDSL_SL14_OFF (28)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL15 */
#define IFX_MSC_DSDSL_SL15_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSL_Bits.SL15 */
#define IFX_MSC_DSDSL_SL15_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL15 */
#define IFX_MSC_DSDSL_SL15_OFF (30)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL1 */
#define IFX_MSC_DSDSL_SL1_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSL_Bits.SL1 */
#define IFX_MSC_DSDSL_SL1_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL1 */
#define IFX_MSC_DSDSL_SL1_OFF (2)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL2 */
#define IFX_MSC_DSDSL_SL2_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSL_Bits.SL2 */
#define IFX_MSC_DSDSL_SL2_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL2 */
#define IFX_MSC_DSDSL_SL2_OFF (4)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL3 */
#define IFX_MSC_DSDSL_SL3_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSL_Bits.SL3 */
#define IFX_MSC_DSDSL_SL3_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL3 */
#define IFX_MSC_DSDSL_SL3_OFF (6)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL4 */
#define IFX_MSC_DSDSL_SL4_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSL_Bits.SL4 */
#define IFX_MSC_DSDSL_SL4_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL4 */
#define IFX_MSC_DSDSL_SL4_OFF (8)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL5 */
#define IFX_MSC_DSDSL_SL5_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSL_Bits.SL5 */
#define IFX_MSC_DSDSL_SL5_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL5 */
#define IFX_MSC_DSDSL_SL5_OFF (10)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL6 */
#define IFX_MSC_DSDSL_SL6_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSL_Bits.SL6 */
#define IFX_MSC_DSDSL_SL6_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL6 */
#define IFX_MSC_DSDSL_SL6_OFF (12)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL7 */
#define IFX_MSC_DSDSL_SL7_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSL_Bits.SL7 */
#define IFX_MSC_DSDSL_SL7_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL7 */
#define IFX_MSC_DSDSL_SL7_OFF (14)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL8 */
#define IFX_MSC_DSDSL_SL8_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSL_Bits.SL8 */
#define IFX_MSC_DSDSL_SL8_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL8 */
#define IFX_MSC_DSDSL_SL8_OFF (16)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL9 */
#define IFX_MSC_DSDSL_SL9_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSL_Bits.SL9 */
#define IFX_MSC_DSDSL_SL9_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL9 */
#define IFX_MSC_DSDSL_SL9_OFF (18)

/** \\brief  Length for Ifx_MSC_DSS_Bits.CFA */
#define IFX_MSC_DSS_CFA_LEN (1)

/** \\brief  Mask for Ifx_MSC_DSS_Bits.CFA */
#define IFX_MSC_DSS_CFA_MSK (0x1)

