HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMsc_bf.h
/** \\brief  Offset for Ifx_MSC_DSS_Bits.CFA */
#define IFX_MSC_DSS_CFA_OFF (25)

/** \\brief  Length for Ifx_MSC_DSS_Bits.DC */
#define IFX_MSC_DSS_DC_LEN (8)

/** \\brief  Mask for Ifx_MSC_DSS_Bits.DC */
#define IFX_MSC_DSS_DC_MSK (0xff)

/** \\brief  Offset for Ifx_MSC_DSS_Bits.DC */
#define IFX_MSC_DSS_DC_OFF (16)

/** \\brief  Length for Ifx_MSC_DSS_Bits.DFA */
#define IFX_MSC_DSS_DFA_LEN (1)

/** \\brief  Mask for Ifx_MSC_DSS_Bits.DFA */
#define IFX_MSC_DSS_DFA_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_DSS_Bits.DFA */
#define IFX_MSC_DSS_DFA_OFF (24)

/** \\brief  Length for Ifx_MSC_DSS_Bits.NPTF */
#define IFX_MSC_DSS_NPTF_LEN (4)

/** \\brief  Mask for Ifx_MSC_DSS_Bits.NPTF */
#define IFX_MSC_DSS_NPTF_MSK (0xf)

/** \\brief  Offset for Ifx_MSC_DSS_Bits.NPTF */
#define IFX_MSC_DSS_NPTF_OFF (8)

/** \\brief  Length for Ifx_MSC_DSS_Bits.PFC */
#define IFX_MSC_DSS_PFC_LEN (4)

/** \\brief  Mask for Ifx_MSC_DSS_Bits.PFC */
#define IFX_MSC_DSS_PFC_MSK (0xf)

/** \\brief  Offset for Ifx_MSC_DSS_Bits.PFC */
#define IFX_MSC_DSS_PFC_OFF (0)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENH0 */
#define IFX_MSC_ESR_ENH0_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENH0 */
#define IFX_MSC_ESR_ENH0_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENH0 */
#define IFX_MSC_ESR_ENH0_OFF (16)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENH10 */
#define IFX_MSC_ESR_ENH10_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENH10 */
#define IFX_MSC_ESR_ENH10_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENH10 */
#define IFX_MSC_ESR_ENH10_OFF (26)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENH11 */
#define IFX_MSC_ESR_ENH11_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENH11 */
#define IFX_MSC_ESR_ENH11_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENH11 */
#define IFX_MSC_ESR_ENH11_OFF (27)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENH12 */
#define IFX_MSC_ESR_ENH12_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENH12 */
#define IFX_MSC_ESR_ENH12_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENH12 */
#define IFX_MSC_ESR_ENH12_OFF (28)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENH13 */
#define IFX_MSC_ESR_ENH13_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENH13 */
#define IFX_MSC_ESR_ENH13_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENH13 */
#define IFX_MSC_ESR_ENH13_OFF (29)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENH14 */
#define IFX_MSC_ESR_ENH14_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENH14 */
#define IFX_MSC_ESR_ENH14_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENH14 */
#define IFX_MSC_ESR_ENH14_OFF (30)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENH15 */
#define IFX_MSC_ESR_ENH15_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENH15 */
#define IFX_MSC_ESR_ENH15_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENH15 */
#define IFX_MSC_ESR_ENH15_OFF (31)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENH1 */
#define IFX_MSC_ESR_ENH1_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENH1 */
#define IFX_MSC_ESR_ENH1_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENH1 */
#define IFX_MSC_ESR_ENH1_OFF (17)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENH2 */
#define IFX_MSC_ESR_ENH2_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENH2 */
#define IFX_MSC_ESR_ENH2_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENH2 */
#define IFX_MSC_ESR_ENH2_OFF (18)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENH3 */
#define IFX_MSC_ESR_ENH3_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENH3 */
#define IFX_MSC_ESR_ENH3_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENH3 */
#define IFX_MSC_ESR_ENH3_OFF (19)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENH4 */
#define IFX_MSC_ESR_ENH4_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENH4 */
#define IFX_MSC_ESR_ENH4_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENH4 */
#define IFX_MSC_ESR_ENH4_OFF (20)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENH5 */
#define IFX_MSC_ESR_ENH5_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENH5 */
#define IFX_MSC_ESR_ENH5_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENH5 */
#define IFX_MSC_ESR_ENH5_OFF (21)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENH6 */
#define IFX_MSC_ESR_ENH6_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENH6 */
#define IFX_MSC_ESR_ENH6_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENH6 */
#define IFX_MSC_ESR_ENH6_OFF (22)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENH7 */
#define IFX_MSC_ESR_ENH7_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENH7 */
#define IFX_MSC_ESR_ENH7_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENH7 */
#define IFX_MSC_ESR_ENH7_OFF (23)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENH8 */
#define IFX_MSC_ESR_ENH8_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENH8 */
#define IFX_MSC_ESR_ENH8_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENH8 */
#define IFX_MSC_ESR_ENH8_OFF (24)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENH9 */
#define IFX_MSC_ESR_ENH9_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENH9 */
#define IFX_MSC_ESR_ENH9_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENH9 */
#define IFX_MSC_ESR_ENH9_OFF (25)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENL0 */
#define IFX_MSC_ESR_ENL0_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENL0 */
#define IFX_MSC_ESR_ENL0_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENL0 */
#define IFX_MSC_ESR_ENL0_OFF (0)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENL10 */
#define IFX_MSC_ESR_ENL10_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENL10 */
#define IFX_MSC_ESR_ENL10_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENL10 */
#define IFX_MSC_ESR_ENL10_OFF (10)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENL11 */
#define IFX_MSC_ESR_ENL11_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENL11 */
#define IFX_MSC_ESR_ENL11_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENL11 */
#define IFX_MSC_ESR_ENL11_OFF (11)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENL12 */
#define IFX_MSC_ESR_ENL12_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENL12 */
#define IFX_MSC_ESR_ENL12_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENL12 */
#define IFX_MSC_ESR_ENL12_OFF (12)

