HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMsc_bf.h
/** \\brief  Length for Ifx_MSC_ESR_Bits.ENL13 */
#define IFX_MSC_ESR_ENL13_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENL13 */
#define IFX_MSC_ESR_ENL13_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENL13 */
#define IFX_MSC_ESR_ENL13_OFF (13)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENL14 */
#define IFX_MSC_ESR_ENL14_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENL14 */
#define IFX_MSC_ESR_ENL14_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENL14 */
#define IFX_MSC_ESR_ENL14_OFF (14)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENL15 */
#define IFX_MSC_ESR_ENL15_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENL15 */
#define IFX_MSC_ESR_ENL15_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENL15 */
#define IFX_MSC_ESR_ENL15_OFF (15)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENL1 */
#define IFX_MSC_ESR_ENL1_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENL1 */
#define IFX_MSC_ESR_ENL1_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENL1 */
#define IFX_MSC_ESR_ENL1_OFF (1)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENL2 */
#define IFX_MSC_ESR_ENL2_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENL2 */
#define IFX_MSC_ESR_ENL2_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENL2 */
#define IFX_MSC_ESR_ENL2_OFF (2)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENL3 */
#define IFX_MSC_ESR_ENL3_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENL3 */
#define IFX_MSC_ESR_ENL3_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENL3 */
#define IFX_MSC_ESR_ENL3_OFF (3)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENL4 */
#define IFX_MSC_ESR_ENL4_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENL4 */
#define IFX_MSC_ESR_ENL4_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENL4 */
#define IFX_MSC_ESR_ENL4_OFF (4)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENL5 */
#define IFX_MSC_ESR_ENL5_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENL5 */
#define IFX_MSC_ESR_ENL5_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENL5 */
#define IFX_MSC_ESR_ENL5_OFF (5)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENL6 */
#define IFX_MSC_ESR_ENL6_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENL6 */
#define IFX_MSC_ESR_ENL6_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENL6 */
#define IFX_MSC_ESR_ENL6_OFF (6)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENL7 */
#define IFX_MSC_ESR_ENL7_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENL7 */
#define IFX_MSC_ESR_ENL7_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENL7 */
#define IFX_MSC_ESR_ENL7_OFF (7)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENL8 */
#define IFX_MSC_ESR_ENL8_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENL8 */
#define IFX_MSC_ESR_ENL8_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENL8 */
#define IFX_MSC_ESR_ENL8_OFF (8)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENL9 */
#define IFX_MSC_ESR_ENL9_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENL9 */
#define IFX_MSC_ESR_ENL9_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENL9 */
#define IFX_MSC_ESR_ENL9_OFF (9)

/** \\brief  Length for Ifx_MSC_FDR_Bits.DISCLK */
#define IFX_MSC_FDR_DISCLK_LEN (1)

/** \\brief  Mask for Ifx_MSC_FDR_Bits.DISCLK */
#define IFX_MSC_FDR_DISCLK_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_FDR_Bits.DISCLK */
#define IFX_MSC_FDR_DISCLK_OFF (31)

/** \\brief  Length for Ifx_MSC_FDR_Bits.DM */
#define IFX_MSC_FDR_DM_LEN (2)

/** \\brief  Mask for Ifx_MSC_FDR_Bits.DM */
#define IFX_MSC_FDR_DM_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_FDR_Bits.DM */
#define IFX_MSC_FDR_DM_OFF (14)

/** \\brief  Length for Ifx_MSC_FDR_Bits.ENHW */
#define IFX_MSC_FDR_ENHW_LEN (1)

/** \\brief  Mask for Ifx_MSC_FDR_Bits.ENHW */
#define IFX_MSC_FDR_ENHW_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_FDR_Bits.ENHW */
#define IFX_MSC_FDR_ENHW_OFF (30)

/** \\brief  Length for Ifx_MSC_FDR_Bits.RESULT */
#define IFX_MSC_FDR_RESULT_LEN (10)

/** \\brief  Mask for Ifx_MSC_FDR_Bits.RESULT */
#define IFX_MSC_FDR_RESULT_MSK (0x3ff)

/** \\brief  Offset for Ifx_MSC_FDR_Bits.RESULT */
#define IFX_MSC_FDR_RESULT_OFF (16)

/** \\brief  Length for Ifx_MSC_FDR_Bits.SC */
#define IFX_MSC_FDR_SC_LEN (2)

/** \\brief  Mask for Ifx_MSC_FDR_Bits.SC */
#define IFX_MSC_FDR_SC_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_FDR_Bits.SC */
#define IFX_MSC_FDR_SC_OFF (12)

/** \\brief  Length for Ifx_MSC_FDR_Bits.SM */
#define IFX_MSC_FDR_SM_LEN (1)

/** \\brief  Mask for Ifx_MSC_FDR_Bits.SM */
#define IFX_MSC_FDR_SM_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_FDR_Bits.SM */
#define IFX_MSC_FDR_SM_OFF (11)

/** \\brief  Length for Ifx_MSC_FDR_Bits.STEP */
#define IFX_MSC_FDR_STEP_LEN (10)

/** \\brief  Mask for Ifx_MSC_FDR_Bits.STEP */
#define IFX_MSC_FDR_STEP_MSK (0x3ff)

/** \\brief  Offset for Ifx_MSC_FDR_Bits.STEP */
#define IFX_MSC_FDR_STEP_OFF (0)

/** \\brief  Length for Ifx_MSC_FDR_Bits.SUSACK */
#define IFX_MSC_FDR_SUSACK_LEN (1)

/** \\brief  Mask for Ifx_MSC_FDR_Bits.SUSACK */
#define IFX_MSC_FDR_SUSACK_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_FDR_Bits.SUSACK */
#define IFX_MSC_FDR_SUSACK_OFF (28)

/** \\brief  Length for Ifx_MSC_FDR_Bits.SUSREQ */
#define IFX_MSC_FDR_SUSREQ_LEN (1)

/** \\brief  Mask for Ifx_MSC_FDR_Bits.SUSREQ */
#define IFX_MSC_FDR_SUSREQ_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_FDR_Bits.SUSREQ */
#define IFX_MSC_FDR_SUSREQ_OFF (29)

/** \\brief  Length for Ifx_MSC_ICR_Bits.ECIE */
#define IFX_MSC_ICR_ECIE_LEN (1)

/** \\brief  Mask for Ifx_MSC_ICR_Bits.ECIE */
#define IFX_MSC_ICR_ECIE_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ICR_Bits.ECIE */
#define IFX_MSC_ICR_ECIE_OFF (7)

/** \\brief  Length for Ifx_MSC_ICR_Bits.ECIP */
#define IFX_MSC_ICR_ECIP_LEN (2)

/** \\brief  Mask for Ifx_MSC_ICR_Bits.ECIP */
#define IFX_MSC_ICR_ECIP_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_ICR_Bits.ECIP */
#define IFX_MSC_ICR_ECIP_OFF (4)

/** \\brief  Length for Ifx_MSC_ICR_Bits.EDIE */
#define IFX_MSC_ICR_EDIE_LEN (2)

/** \\brief  Mask for Ifx_MSC_ICR_Bits.EDIE */
#define IFX_MSC_ICR_EDIE_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_ICR_Bits.EDIE */
#define IFX_MSC_ICR_EDIE_OFF (2)

/** \\brief  Length for Ifx_MSC_ICR_Bits.EDIP */
#define IFX_MSC_ICR_EDIP_LEN (2)

/** \\brief  Mask for Ifx_MSC_ICR_Bits.EDIP */
#define IFX_MSC_ICR_EDIP_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_ICR_Bits.EDIP */
#define IFX_MSC_ICR_EDIP_OFF (0)

