HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMsc_bf.h
/** \\brief  Length for Ifx_MSC_ICR_Bits.RDIE */
#define IFX_MSC_ICR_RDIE_LEN (2)

/** \\brief  Mask for Ifx_MSC_ICR_Bits.RDIE */
#define IFX_MSC_ICR_RDIE_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_ICR_Bits.RDIE */
#define IFX_MSC_ICR_RDIE_OFF (14)

/** \\brief  Length for Ifx_MSC_ICR_Bits.RDIP */
#define IFX_MSC_ICR_RDIP_LEN (2)

/** \\brief  Mask for Ifx_MSC_ICR_Bits.RDIP */
#define IFX_MSC_ICR_RDIP_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_ICR_Bits.RDIP */
#define IFX_MSC_ICR_RDIP_OFF (12)

/** \\brief  Length for Ifx_MSC_ICR_Bits.TFIE */
#define IFX_MSC_ICR_TFIE_LEN (1)

/** \\brief  Mask for Ifx_MSC_ICR_Bits.TFIE */
#define IFX_MSC_ICR_TFIE_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ICR_Bits.TFIE */
#define IFX_MSC_ICR_TFIE_OFF (11)

/** \\brief  Length for Ifx_MSC_ICR_Bits.TFIP */
#define IFX_MSC_ICR_TFIP_LEN (2)

/** \\brief  Mask for Ifx_MSC_ICR_Bits.TFIP */
#define IFX_MSC_ICR_TFIP_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_ICR_Bits.TFIP */
#define IFX_MSC_ICR_TFIP_OFF (8)

/** \\brief  Length for Ifx_MSC_ID_Bits.MODNUMBER */
#define IFX_MSC_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_MSC_ID_Bits.MODNUMBER */
#define IFX_MSC_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_MSC_ID_Bits.MODNUMBER */
#define IFX_MSC_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_MSC_ID_Bits.MODREV */
#define IFX_MSC_ID_MODREV_LEN (8)

/** \\brief  Mask for Ifx_MSC_ID_Bits.MODREV */
#define IFX_MSC_ID_MODREV_MSK (0xff)

/** \\brief  Offset for Ifx_MSC_ID_Bits.MODREV */
#define IFX_MSC_ID_MODREV_OFF (0)

/** \\brief  Length for Ifx_MSC_ID_Bits.MODTYPE */
#define IFX_MSC_ID_MODTYPE_LEN (8)

/** \\brief  Mask for Ifx_MSC_ID_Bits.MODTYPE */
#define IFX_MSC_ID_MODTYPE_MSK (0xff)

/** \\brief  Offset for Ifx_MSC_ID_Bits.MODTYPE */
#define IFX_MSC_ID_MODTYPE_OFF (8)

/** \\brief  Length for Ifx_MSC_ISC_Bits.CCP */
#define IFX_MSC_ISC_CCP_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISC_Bits.CCP */
#define IFX_MSC_ISC_CCP_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISC_Bits.CCP */
#define IFX_MSC_ISC_CCP_OFF (5)

/** \\brief  Length for Ifx_MSC_ISC_Bits.CDDIS */
#define IFX_MSC_ISC_CDDIS_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISC_Bits.CDDIS */
#define IFX_MSC_ISC_CDDIS_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISC_Bits.CDDIS */
#define IFX_MSC_ISC_CDDIS_OFF (6)

/** \\brief  Length for Ifx_MSC_ISC_Bits.CDECI */
#define IFX_MSC_ISC_CDECI_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISC_Bits.CDECI */
#define IFX_MSC_ISC_CDECI_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISC_Bits.CDECI */
#define IFX_MSC_ISC_CDECI_OFF (1)

/** \\brief  Length for Ifx_MSC_ISC_Bits.CDEDI */
#define IFX_MSC_ISC_CDEDI_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISC_Bits.CDEDI */
#define IFX_MSC_ISC_CDEDI_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISC_Bits.CDEDI */
#define IFX_MSC_ISC_CDEDI_OFF (0)

/** \\brief  Length for Ifx_MSC_ISC_Bits.CDP */
#define IFX_MSC_ISC_CDP_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISC_Bits.CDP */
#define IFX_MSC_ISC_CDP_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISC_Bits.CDP */
#define IFX_MSC_ISC_CDP_OFF (4)

/** \\brief  Length for Ifx_MSC_ISC_Bits.CDTFI */
#define IFX_MSC_ISC_CDTFI_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISC_Bits.CDTFI */
#define IFX_MSC_ISC_CDTFI_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISC_Bits.CDTFI */
#define IFX_MSC_ISC_CDTFI_OFF (2)

/** \\brief  Length for Ifx_MSC_ISC_Bits.CURDI */
#define IFX_MSC_ISC_CURDI_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISC_Bits.CURDI */
#define IFX_MSC_ISC_CURDI_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISC_Bits.CURDI */
#define IFX_MSC_ISC_CURDI_OFF (3)

/** \\brief  Length for Ifx_MSC_ISC_Bits.SCP */
#define IFX_MSC_ISC_SCP_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISC_Bits.SCP */
#define IFX_MSC_ISC_SCP_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISC_Bits.SCP */
#define IFX_MSC_ISC_SCP_OFF (21)

/** \\brief  Length for Ifx_MSC_ISC_Bits.SDDIS */
#define IFX_MSC_ISC_SDDIS_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISC_Bits.SDDIS */
#define IFX_MSC_ISC_SDDIS_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISC_Bits.SDDIS */
#define IFX_MSC_ISC_SDDIS_OFF (22)

/** \\brief  Length for Ifx_MSC_ISC_Bits.SDECI */
#define IFX_MSC_ISC_SDECI_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISC_Bits.SDECI */
#define IFX_MSC_ISC_SDECI_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISC_Bits.SDECI */
#define IFX_MSC_ISC_SDECI_OFF (17)

/** \\brief  Length for Ifx_MSC_ISC_Bits.SDEDI */
#define IFX_MSC_ISC_SDEDI_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISC_Bits.SDEDI */
#define IFX_MSC_ISC_SDEDI_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISC_Bits.SDEDI */
#define IFX_MSC_ISC_SDEDI_OFF (16)

/** \\brief  Length for Ifx_MSC_ISC_Bits.SDP */
#define IFX_MSC_ISC_SDP_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISC_Bits.SDP */
#define IFX_MSC_ISC_SDP_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISC_Bits.SDP */
#define IFX_MSC_ISC_SDP_OFF (20)

/** \\brief  Length for Ifx_MSC_ISC_Bits.SDTFI */
#define IFX_MSC_ISC_SDTFI_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISC_Bits.SDTFI */
#define IFX_MSC_ISC_SDTFI_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISC_Bits.SDTFI */
#define IFX_MSC_ISC_SDTFI_OFF (18)

/** \\brief  Length for Ifx_MSC_ISC_Bits.SURDI */
#define IFX_MSC_ISC_SURDI_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISC_Bits.SURDI */
#define IFX_MSC_ISC_SURDI_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISC_Bits.SURDI */
#define IFX_MSC_ISC_SURDI_OFF (19)

/** \\brief  Length for Ifx_MSC_ISR_Bits.DECI */
#define IFX_MSC_ISR_DECI_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISR_Bits.DECI */
#define IFX_MSC_ISR_DECI_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISR_Bits.DECI */
#define IFX_MSC_ISR_DECI_OFF (1)

/** \\brief  Length for Ifx_MSC_ISR_Bits.DEDI */
#define IFX_MSC_ISR_DEDI_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISR_Bits.DEDI */
#define IFX_MSC_ISR_DEDI_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISR_Bits.DEDI */
#define IFX_MSC_ISR_DEDI_OFF (0)

/** \\brief  Length for Ifx_MSC_ISR_Bits.DTFI */
#define IFX_MSC_ISR_DTFI_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISR_Bits.DTFI */
#define IFX_MSC_ISR_DTFI_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISR_Bits.DTFI */
#define IFX_MSC_ISR_DTFI_OFF (2)

/** \\brief  Length for Ifx_MSC_ISR_Bits.URDI */
#define IFX_MSC_ISR_URDI_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISR_Bits.URDI */
#define IFX_MSC_ISR_URDI_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISR_Bits.URDI */
#define IFX_MSC_ISR_URDI_OFF (3)

