HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMsc_bf.h
/** \\brief  Length for Ifx_MSC_KRST0_Bits.RST */
#define IFX_MSC_KRST0_RST_LEN (1)

/** \\brief  Mask for Ifx_MSC_KRST0_Bits.RST */
#define IFX_MSC_KRST0_RST_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_KRST0_Bits.RST */
#define IFX_MSC_KRST0_RST_OFF (0)

/** \\brief  Length for Ifx_MSC_KRST0_Bits.RSTSTAT */
#define IFX_MSC_KRST0_RSTSTAT_LEN (1)

/** \\brief  Mask for Ifx_MSC_KRST0_Bits.RSTSTAT */
#define IFX_MSC_KRST0_RSTSTAT_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_KRST0_Bits.RSTSTAT */
#define IFX_MSC_KRST0_RSTSTAT_OFF (1)

/** \\brief  Length for Ifx_MSC_KRST1_Bits.RST */
#define IFX_MSC_KRST1_RST_LEN (1)

/** \\brief  Mask for Ifx_MSC_KRST1_Bits.RST */
#define IFX_MSC_KRST1_RST_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_KRST1_Bits.RST */
#define IFX_MSC_KRST1_RST_OFF (0)

/** \\brief  Length for Ifx_MSC_KRSTCLR_Bits.CLR */
#define IFX_MSC_KRSTCLR_CLR_LEN (1)

/** \\brief  Mask for Ifx_MSC_KRSTCLR_Bits.CLR */
#define IFX_MSC_KRSTCLR_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_KRSTCLR_Bits.CLR */
#define IFX_MSC_KRSTCLR_CLR_OFF (0)

/** \\brief  Length for Ifx_MSC_OCR_Bits.CLKCTRL */
#define IFX_MSC_OCR_CLKCTRL_LEN (1)

/** \\brief  Mask for Ifx_MSC_OCR_Bits.CLKCTRL */
#define IFX_MSC_OCR_CLKCTRL_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_OCR_Bits.CLKCTRL */
#define IFX_MSC_OCR_CLKCTRL_OFF (8)

/** \\brief  Length for Ifx_MSC_OCR_Bits.CLP */
#define IFX_MSC_OCR_CLP_LEN (1)

/** \\brief  Mask for Ifx_MSC_OCR_Bits.CLP */
#define IFX_MSC_OCR_CLP_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_OCR_Bits.CLP */
#define IFX_MSC_OCR_CLP_OFF (0)

/** \\brief  Length for Ifx_MSC_OCR_Bits.CSC */
#define IFX_MSC_OCR_CSC_LEN (2)

/** \\brief  Mask for Ifx_MSC_OCR_Bits.CSC */
#define IFX_MSC_OCR_CSC_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_OCR_Bits.CSC */
#define IFX_MSC_OCR_CSC_OFF (13)

/** \\brief  Length for Ifx_MSC_OCR_Bits.CSH */
#define IFX_MSC_OCR_CSH_LEN (2)

/** \\brief  Mask for Ifx_MSC_OCR_Bits.CSH */
#define IFX_MSC_OCR_CSH_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_OCR_Bits.CSH */
#define IFX_MSC_OCR_CSH_OFF (11)

/** \\brief  Length for Ifx_MSC_OCR_Bits.CSL */
#define IFX_MSC_OCR_CSL_LEN (2)

/** \\brief  Mask for Ifx_MSC_OCR_Bits.CSL */
#define IFX_MSC_OCR_CSL_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_OCR_Bits.CSL */
#define IFX_MSC_OCR_CSL_OFF (9)

/** \\brief  Length for Ifx_MSC_OCR_Bits.CSLP */
#define IFX_MSC_OCR_CSLP_LEN (1)

/** \\brief  Mask for Ifx_MSC_OCR_Bits.CSLP */
#define IFX_MSC_OCR_CSLP_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_OCR_Bits.CSLP */
#define IFX_MSC_OCR_CSLP_OFF (2)

/** \\brief  Length for Ifx_MSC_OCR_Bits.ILP */
#define IFX_MSC_OCR_ILP_LEN (1)

/** \\brief  Mask for Ifx_MSC_OCR_Bits.ILP */
#define IFX_MSC_OCR_ILP_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_OCR_Bits.ILP */
#define IFX_MSC_OCR_ILP_OFF (3)

/** \\brief  Length for Ifx_MSC_OCR_Bits.SDISEL */
#define IFX_MSC_OCR_SDISEL_LEN (3)

/** \\brief  Mask for Ifx_MSC_OCR_Bits.SDISEL */
#define IFX_MSC_OCR_SDISEL_MSK (0x7)

/** \\brief  Offset for Ifx_MSC_OCR_Bits.SDISEL */
#define IFX_MSC_OCR_SDISEL_OFF (16)

/** \\brief  Length for Ifx_MSC_OCR_Bits.SLP */
#define IFX_MSC_OCR_SLP_LEN (1)

/** \\brief  Mask for Ifx_MSC_OCR_Bits.SLP */
#define IFX_MSC_OCR_SLP_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_OCR_Bits.SLP */
#define IFX_MSC_OCR_SLP_OFF (1)

/** \\brief  Length for Ifx_MSC_OCS_Bits.SUS */
#define IFX_MSC_OCS_SUS_LEN (4)

/** \\brief  Mask for Ifx_MSC_OCS_Bits.SUS */
#define IFX_MSC_OCS_SUS_MSK (0xf)

/** \\brief  Offset for Ifx_MSC_OCS_Bits.SUS */
#define IFX_MSC_OCS_SUS_OFF (24)

/** \\brief  Length for Ifx_MSC_OCS_Bits.SUS_P */
#define IFX_MSC_OCS_SUS_P_LEN (1)

/** \\brief  Mask for Ifx_MSC_OCS_Bits.SUS_P */
#define IFX_MSC_OCS_SUS_P_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_OCS_Bits.SUS_P */
#define IFX_MSC_OCS_SUS_P_OFF (28)

/** \\brief  Length for Ifx_MSC_OCS_Bits.SUSSTA */
#define IFX_MSC_OCS_SUSSTA_LEN (1)

/** \\brief  Mask for Ifx_MSC_OCS_Bits.SUSSTA */
#define IFX_MSC_OCS_SUSSTA_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_OCS_Bits.SUSSTA */
#define IFX_MSC_OCS_SUSSTA_OFF (29)

/** \\brief  Length for Ifx_MSC_UD_Bits.C */
#define IFX_MSC_UD_C_LEN (1)

/** \\brief  Mask for Ifx_MSC_UD_Bits.C */
#define IFX_MSC_UD_C_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_UD_Bits.C */
#define IFX_MSC_UD_C_OFF (18)

/** \\brief  Length for Ifx_MSC_UD_Bits.DATA */
#define IFX_MSC_UD_DATA_LEN (8)

/** \\brief  Mask for Ifx_MSC_UD_Bits.DATA */
#define IFX_MSC_UD_DATA_MSK (0xff)

/** \\brief  Offset for Ifx_MSC_UD_Bits.DATA */
#define IFX_MSC_UD_DATA_OFF (0)

/** \\brief  Length for Ifx_MSC_UD_Bits.IPF */
#define IFX_MSC_UD_IPF_LEN (1)

/** \\brief  Mask for Ifx_MSC_UD_Bits.IPF */
#define IFX_MSC_UD_IPF_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_UD_Bits.IPF */
#define IFX_MSC_UD_IPF_OFF (21)

/** \\brief  Length for Ifx_MSC_UD_Bits.LABF */
#define IFX_MSC_UD_LABF_LEN (2)

/** \\brief  Mask for Ifx_MSC_UD_Bits.LABF */
#define IFX_MSC_UD_LABF_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_UD_Bits.LABF */
#define IFX_MSC_UD_LABF_OFF (19)

/** \\brief  Length for Ifx_MSC_UD_Bits.P */
#define IFX_MSC_UD_P_LEN (1)

/** \\brief  Mask for Ifx_MSC_UD_Bits.P */
#define IFX_MSC_UD_P_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_UD_Bits.P */
#define IFX_MSC_UD_P_OFF (17)

/** \\brief  Length for Ifx_MSC_UD_Bits.PERR */
#define IFX_MSC_UD_PERR_LEN (1)

/** \\brief  Mask for Ifx_MSC_UD_Bits.PERR */
#define IFX_MSC_UD_PERR_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_UD_Bits.PERR */
#define IFX_MSC_UD_PERR_OFF (22)

/** \\brief  Length for Ifx_MSC_UD_Bits.V */
#define IFX_MSC_UD_V_LEN (1)

/** \\brief  Mask for Ifx_MSC_UD_Bits.V */
#define IFX_MSC_UD_V_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_UD_Bits.V */
#define IFX_MSC_UD_V_OFF (16)

/** \\brief  Length for Ifx_MSC_USCE_Bits.USTC */
#define IFX_MSC_USCE_USTC_LEN (1)

/** \\brief  Mask for Ifx_MSC_USCE_Bits.USTC */
#define IFX_MSC_USCE_USTC_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_USCE_Bits.USTC */
#define IFX_MSC_USCE_USTC_OFF (10)

/** \\brief  Length for Ifx_MSC_USCE_Bits.USTF */
#define IFX_MSC_USCE_USTF_LEN (1)

/** \\brief  Mask for Ifx_MSC_USCE_Bits.USTF */
#define IFX_MSC_USCE_USTF_MSK (0x1)

