HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMsc_bf.h
/** \\brief  Offset for Ifx_MSC_USCE_Bits.USTF */
#define IFX_MSC_USCE_USTF_OFF (9)

/** \\brief  Length for Ifx_MSC_USCE_Bits.USTOEN */
#define IFX_MSC_USCE_USTOEN_LEN (1)

/** \\brief  Mask for Ifx_MSC_USCE_Bits.USTOEN */
#define IFX_MSC_USCE_USTOEN_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_USCE_Bits.USTOEN */
#define IFX_MSC_USCE_USTOEN_OFF (8)

/** \\brief  Length for Ifx_MSC_USCE_Bits.USTOIP */
#define IFX_MSC_USCE_USTOIP_LEN (2)

/** \\brief  Mask for Ifx_MSC_USCE_Bits.USTOIP */
#define IFX_MSC_USCE_USTOIP_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_USCE_Bits.USTOIP */
#define IFX_MSC_USCE_USTOIP_OFF (14)

/** \\brief  Length for Ifx_MSC_USCE_Bits.USTOPRE */
#define IFX_MSC_USCE_USTOPRE_LEN (4)

/** \\brief  Mask for Ifx_MSC_USCE_Bits.USTOPRE */
#define IFX_MSC_USCE_USTOPRE_MSK (0xf)

/** \\brief  Offset for Ifx_MSC_USCE_Bits.USTOPRE */
#define IFX_MSC_USCE_USTOPRE_OFF (0)

/** \\brief  Length for Ifx_MSC_USCE_Bits.USTOVAL */
#define IFX_MSC_USCE_USTOVAL_LEN (4)

/** \\brief  Mask for Ifx_MSC_USCE_Bits.USTOVAL */
#define IFX_MSC_USCE_USTOVAL_MSK (0xf)

/** \\brief  Offset for Ifx_MSC_USCE_Bits.USTOVAL */
#define IFX_MSC_USCE_USTOVAL_OFF (4)

/** \\brief  Length for Ifx_MSC_USCE_Bits.USTS */
#define IFX_MSC_USCE_USTS_LEN (1)

/** \\brief  Mask for Ifx_MSC_USCE_Bits.USTS */
#define IFX_MSC_USCE_USTS_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_USCE_Bits.USTS */
#define IFX_MSC_USCE_USTS_OFF (11)

/** \\brief  Length for Ifx_MSC_USCE_Bits.UTASR */
#define IFX_MSC_USCE_UTASR_LEN (1)

/** \\brief  Mask for Ifx_MSC_USCE_Bits.UTASR */
#define IFX_MSC_USCE_UTASR_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_USCE_Bits.UTASR */
#define IFX_MSC_USCE_UTASR_OFF (13)

/** \\brief  Length for Ifx_MSC_USR_Bits.PCTR */
#define IFX_MSC_USR_PCTR_LEN (1)

/** \\brief  Mask for Ifx_MSC_USR_Bits.PCTR */
#define IFX_MSC_USR_PCTR_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_USR_Bits.PCTR */
#define IFX_MSC_USR_PCTR_OFF (4)

/** \\brief  Length for Ifx_MSC_USR_Bits.SRDC */
#define IFX_MSC_USR_SRDC_LEN (1)

/** \\brief  Mask for Ifx_MSC_USR_Bits.SRDC */
#define IFX_MSC_USR_SRDC_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_USR_Bits.SRDC */
#define IFX_MSC_USR_SRDC_OFF (5)

/** \\brief  Length for Ifx_MSC_USR_Bits.UC */
#define IFX_MSC_USR_UC_LEN (5)

/** \\brief  Mask for Ifx_MSC_USR_Bits.UC */
#define IFX_MSC_USR_UC_MSK (0x1f)

/** \\brief  Offset for Ifx_MSC_USR_Bits.UC */
#define IFX_MSC_USR_UC_OFF (16)

/** \\brief  Length for Ifx_MSC_USR_Bits.UFT */
#define IFX_MSC_USR_UFT_LEN (1)

/** \\brief  Mask for Ifx_MSC_USR_Bits.UFT */
#define IFX_MSC_USR_UFT_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_USR_Bits.UFT */
#define IFX_MSC_USR_UFT_OFF (0)

/** \\brief  Length for Ifx_MSC_USR_Bits.URR */
#define IFX_MSC_USR_URR_LEN (3)

/** \\brief  Mask for Ifx_MSC_USR_Bits.URR */
#define IFX_MSC_USR_URR_MSK (0x7)

/** \\brief  Offset for Ifx_MSC_USR_Bits.URR */
#define IFX_MSC_USR_URR_OFF (1)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXMSC_BF_H */
